Revit 2026 API

# DirectShapeTypeIsValidShape(ExternallyTaggedGeometryObject) Method

---

Validates shape to be stored in a DirectShapeType.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsValidShape(
	ExternallyTaggedGeometryObject externallyTaggedGeometry
)
```
```vb
Public Function IsValidShape (
	externallyTaggedGeometry As ExternallyTaggedGeometryObject
) As Boolean
```
```cpp
public:
bool IsValidShape(
	ExternallyTaggedGeometryObject^ externallyTaggedGeometry
)
```
```fsharp
member IsValidShape :
        externallyTaggedGeometry : ExternallyTaggedGeometryObject -> bool
```

#### Parameters

externallyTaggedGeometry ExternallyTaggedGeometryObject
     The supported types of GeometryObjects are: Solid, Mesh, GeometryInstance, Point and Curve.

#### Return Value

Boolean True if the supplied shape passes the validation criteria.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

This function uses the same criteria as IsValidShape(GeometryObject).

#### Reference

DirectShapeType Class

IsValidShape Overload

Autodesk.Revit.DB Namespace